1s/ERP/Conf/Documents/Лико_ФормированиеПаллета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ФормированиеПаллета</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Лико_УчетГотовыхЭтикеток</xr:Item>
				<xr:Item>InformationRegister.Лико_АдресноеХранение</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЯчейкаПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Паллет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Паллеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ТипыФормированияПаллет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводственноеПомещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ПроизводственныеПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыпускИзРастарки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаспоряжениеНаРастарку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Лико_ПеремещениеПаллета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФормирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПоследнийВыпускПоРастарке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаРастарка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Comment>Используется для документов с типом "Перемещение с неордерного склада"</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РастаркаПоСтаройСхемеВерсии2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданНаОснованииПолученияГПИзПроизводства</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУпрощенногоПроведения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Содержимое</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыбылСоСклада</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СодержимоеРастарки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Лико_РаспоряжениеНаРастарку</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Лико_ПеремещениеПаллета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Лико_НомерЦепочкиВРаспоряженииНаРастарку</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/AccumulationRegisters/Лико_ЗатратыПоЗаказу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Лико_ЗатратыПоЗаказу</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоШт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Метраж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Нарезка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЯССМ_Нарезки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентЗаливки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грамматура</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходКраски</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентГрамматура</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетражПМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентПереноса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Плотность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЦветов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентКМетражу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойЭлемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавленоНаВыброс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентВСмеси</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РабочийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Затрата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПроката</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРаботСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерРаботы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДавальческоеСырье</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНастроечногоМатериала</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ВидыНастроечногоМатериала</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСекции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ВидыСекций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЦвета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ТипыЦвета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ТипыФормированияПаллет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ТипыФормированияПаллет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыпускПродукции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переупаковка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеСНеордерногоСклада</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ТипыСкладовГотовойПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ТипыСкладовГотовойПродукции</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Производство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Регион</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Брак</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственноеХранениеТовараКлиентаУНас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственноеХранениеНашегоТовараУКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственноеХранениеТовараДругойПлощадки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственноеХранениеТовараДругойПлощадкиСПравомПродажи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ФормированиеПаллета/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			ОбработатьШтрихкоды(ПодключаемоеОборудованиеУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр));
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
	Если ИмяСобытия = "Лико_ПередачаМассиваСозданныхСерийЧерезПомощникЛинкс" И Объект.Комментарий = Параметр.СтруктураРастарки.НомерДокумента Тогда
		Для каждого ТекСерия из Параметр.МассивСерий Цикл
			НоваяСтрока = Объект.Содержимое.Добавить();
			НоваяСтрока.Серия = ТекСерия;
			Модифицированность = Истина;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьШтрихкодыСервер(ДанныеШтрихкода)
	
	//Найдем серию
	МассивСерий = Лико_Дополнительно.НайтиСерииПоШтрихкоду(ДанныеШтрихкода.Штрихкод);
	СерияНайдена = МассивСерий.Количество() > 0;
	Для каждого Серия из МассивСерий Цикл
		Если Объект.Содержимое.НайтиСтроки(Новый Структура("Серия", Серия)).Количество() = 0 Тогда
			НоваяСтрока = Объект.Содержимое.Добавить();
			НоваяСтрока.Серия = Серия;
			//ПроверитьИзменитьОрганизациюДокумента();
		Иначе
			Сообщить("Серия """ + Серия + """ уже добавлена в паллет.");
		КонецЕсли;
	КонецЦикла;
		
	Если НЕ СерияНайдена Тогда
		
		// Обработаем "наши" штрихкоды
		Результат = Лико_Дополнительно.ОбработатьШтрихКодНеТовараСервер(ДанныеШтрихкода.Штрихкод);
		Если Результат.Ошибка <> "" Тогда
			// Попробуем найти распоряжение на растарку
			Менеджеры = Новый Массив;
			Менеджеры.Добавить(Документы.Лико_ПеремещениеПаллета.ПустаяСсылка());
			МассивСсылок = ШтрихкодированиеПечатныхФорм.ПолучитьСсылкуПоШтрихкодуТабличногоДокумента(ДанныеШтрихкода.Штрихкод, Менеджеры);
			Если МассивСсылок.Количество() = 0 ИЛИ ТипЗнч(МассивСсылок[0]) <> Тип("ДокументСсылка.Лико_ПеремещениеПаллета") Тогда
				// распоряжение на растарку не нашли
				Сообщить(Результат.Ошибка);
			Иначе
				
				Если НЕ Объект.ВыпускИзРастарки Тогда
					Сообщить("Вы считали бланк распоряжения на растарку, поэтому паллету был установлен признак ""Выпуск из растарки""");
					Объект.ВыпускИзРастарки = Истина;
					Объект.ТипДокумента = Перечисления.Лико_ТипыФормированияПаллет.ВыпускПродукции;
					УправлениеЭлементамиФормы();
				КонецЕсли;
				Объект.РаспоряжениеНаРастарку = МассивСсылок[0];
				Если Объект.ЯчейкаРастарка <> Объект.РаспоряжениеНаРастарку.ЯчейкаПолучатель Тогда
					Объект.ЯчейкаРастарка = Объект.РаспоряжениеНаРастарку.ЯчейкаПолучатель;
					Объект.ЯчейкаПолучатель = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, Объект.ЯчейкаРастарка.Владелец, "ЯчейкаХранениеПоУмолчанию");
				КонецЕсли;
				Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаОсновное;
			КонецЕсли;
		Иначе
			Если Результат.ВидШК = Перечисления.ЯС_ВидыШК.ШК_Паллета Тогда
				//Это паллет
				//Объект.Паллет = Результат.Паллет;
				//Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаОсновное;
				
				// Теперь при считывании паллета будем добавлять коробки паллета в содержимое
				ТаблицаСерий = Лико_Дополнительно.ПолучитьСодержимоеПаллета(Результат.Паллет);
				Если ТаблицаСерий = Неопределено Тогда
					Возврат;
				КонецЕсли;
				сч = 0;
				Для каждого Строка из ТаблицаСерий Цикл
					Если Объект.Содержимое.НайтиСтроки(Новый Структура("Серия", Строка.Серия)).Количество() = 0 Тогда
						ЗаполнитьЗначенияСвойств(Объект.Содержимое.Добавить(), Строка);
					Иначе
						Сообщить("Серия """ + Строка.Серия + """ уже добавлена в паллет.");
					КонецЕсли;
					ПроверитьИзменитьОрганизациюДокумента();
				КонецЦикла;				
				
			ИначеЕсли Результат.ВидШК = Перечисления.ЯС_ВидыШК.ШК_Сотрудника Тогда
				//Это физ. лицо
				Объект.АвторДокумента = Результат.Сотрудник;
				Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаОсновное;
			ИначеЕсли Результат.ВидШК = Перечисления.ЯС_ВидыШК.ШК_Адреса
				ИЛИ Результат.ВидШК = Перечисления.ЯС_ВидыШК.ШК_Адреса_Короткий Тогда
				//Это ячейка
				Объект.ЯчейкаПолучатель = Результат.АдресаХранения;
				Объект.ЯчейкаРастарка = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, Объект.ЯчейкаПолучатель.Владелец, "ЯчейкаРастарка");
				Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаОсновное;
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаТовары;
		ПроверитьИзменитьОрганизациюДокумента();
	КонецЕсли;
	РассчитатьКоличествоКоробок();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьИзменитьОрганизациюДокумента()
	
	Если Объект.ТипДокумента <> Перечисления.Лико_ТипыФормированияПаллет.ВыпускПродукции Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Содержимое.Количество() <> 1 Тогда
		Возврат;
	КонецЕсли;
	//Если Объект.ПроизводственноеПомещение <> Справочники.Лико_ПроизводственныеПомещения.Шобер Тогда
	//	Возврат;
	//КонецЕсли;
	
	ПлощадкаПервойКоробки = Объект.Содержимое[0].Серия.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры.Площадка;
	Если ПлощадкаПервойКоробки <> Объект.Площадка Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Склады.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Склады КАК Склады
			|ГДЕ
			|	Склады.Лико_Площадка = &Лико_Площадка
			|	И Склады.Лико_ТипСкладаГотовойПродукции = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыСкладовГотовойПродукции.Производство)
			|	И НЕ Склады.ПометкаУдаления";
		
		Запрос.УстановитьПараметр("Лико_Площадка", ПлощадкаПервойКоробки);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		НовыйСклад = Неопределено;
		//Если ВыборкаДетальныеЗаписи.Количество() <> 1 Тогда
		//	Сообщить("Найдено " + ВыборкаДетальныеЗаписи.Количество() + " склада с типом ""Производство"" по площадке """ + ПлощадкаПервойКоробки + """. Обратитесь к программистам");
		//	Возврат;
		//ИначеЕсли ПлощадкаПервойКоробки = Справочники.Лико_Площадки.Линкс Тогда
		//	НовыйСклад = Справочники.Лико_ПредопределенныеЗначения.СкладГпЮзВМеталлострое.ЗначениеПараметра;	
		//Иначе
		//	ВыборкаДетальныеЗаписи.Следующий();
		//	НовыйСклад = ВыборкаДетальныеЗаписи.Ссылка;
		//КонецЕсли; 
		Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда
			ВыборкаДетальныеЗаписи.Следующий();
			НовыйСклад = ВыборкаДетальныеЗаписи.Ссылка;
		ИначеЕсли ПлощадкаПервойКоробки = Справочники.Лико_Площадки.Линкс Тогда
			НовыйСклад = Справочники.Лико_ПредопределенныеЗначения.СкладГпЮзВМеталлострое.ЗначениеПараметра;	
		Иначе
			Сообщить("Найдено " + ВыборкаДетальныеЗаписи.Количество() + " склада с типом ""Производство"" по площадке """ + ПлощадкаПервойКоробки + """. Обратитесь к программистам");
			Возврат;
		КонецЕсли; 
		Если ЗначениеЗаполнено(НовыйСклад) Тогда
			ЯчейкаУпаковка = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, НовыйСклад, "ЯчейкаУпаковка");
			Если НЕ ЗначениеЗаполнено(ЯчейкаУпаковка) Тогда
				Сообщить("Не найдена ячейка-упаковка для склада """ + НовыйСклад + """. Обратитесь к программистам");
				Возврат;
			КонецЕсли;
			ЯчейкаРастарка = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, НовыйСклад, "ЯчейкаРастарка");
			Если НЕ ЗначениеЗаполнено(ЯчейкаРастарка) Тогда
				Сообщить("Не найдена ячейка-растарка для склада """ + НовыйСклад + """. Обратитесь к программистам");
				Возврат;
			КонецЕсли;
			Объект.Площадка = ПлощадкаПервойКоробки;
			Объект.Организация = ПлощадкаПервойКоробки.Организация;
			Объект.ЯчейкаПолучатель = ЯчейкаУпаковка;
			Объект.ЯчейкаРастарка = ЯчейкаРастарка;
			Если ЗначениеЗаполнено(НовыйСклад.Подразделение) И Объект.Подразделение <> НовыйСклад.Подразделение Тогда
				Объект.Подразделение = НовыйСклад.Подразделение;
			КонецЕсли;
			Сообщить("Изменена площадка документа на """ + Объект.площадка + """, т.к. вы считали штриход коробки другой площадки");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	
	Если Объект.СозданНаОснованииПолученияГПИзПроизводства Тогда
		Сообщить("Документ создан на основании " + Метаданные.Документы.Лико_ПолучениеГПИзПроизводства.Представление() + ", корректировка возможно только под полными правами");
		Если НЕ ТолькоПросмотр Тогда
			ТолькоПросмотр = НЕ РольДоступна("ПолныеПрава");
		КонецЕсли;
	КонецЕсли;
	
	ТиповыеДокументы.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) И НЕ ЗначениеЗаполнено(Объект.ТипДокумента) Тогда
		Параметры.Свойство("ТипДокумента", Объект.ТипДокумента);
		Если НЕ ЗначениеЗаполнено(Объект.ТипДокумента) Тогда
			Объект.ТипДокумента = Перечисления.Лико_ТипыФормированияПаллет.Переупаковка;
		КонецЕсли;
		Параметры.Свойство("ФизЛицо", Объект.АвторДокумента);
		Параметры.Свойство("ВыпускИзРастарки", Объект.ВыпускИзРастарки);
		Объект.РабочееМесто = ПараметрыСеанса.Лико_РабочееМесто;
		Если НЕ ЗначениеЗаполнено(Объект.АвторДокумента) Тогда
			Объект.АвторДокумента = Объект.РабочееМесто.СотрудникПоF2;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.АвторДокумента) Тогда
			Объект.АвторДокумента = Объект.РабочееМесто.СотрудникПоF3;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.АвторДокумента) Тогда
			Объект.АвторДокумента = ПараметрыСеанса.ТекущийПользователь.ФизическоеЛицо;
		КонецЕсли;
		//Если Параметры.Свойство("СоздатьНовыйПаллет") И Параметры.СоздатьНовыйПаллет Тогда
			//Нужно создавать паллет
			Объект.Паллет = Лико_Дополнительно.СоздатьНовыйПаллет(Объект.АвторДокумента);
		//КонецЕсли;
		ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
		Объект.Площадка = Лико_Дополнительно.ПлощадкаПользователяПоУмолчанию(); 
		Объект.Организация = Объект.Площадка.Организация; 
		Объект.Подразделение = ТекущийПользователь.Подразделение;
		Параметры.Свойство("ЯчейкаПолучатель", Объект.ЯчейкаПолучатель);
		Если НЕ ЗначениеЗаполнено(Объект.ЯчейкаПолучатель) Тогда
			Если Объект.ТипДокумента = Перечисления.Лико_ТипыФормированияПаллет.ВыпускПродукции Тогда
				Объект.ЯчейкаПолучатель = Объект.РабочееМесто.АдресРазмещенияНовогоПаллетаУпаковка;
			Иначе
				Объект.ЯчейкаПолучатель = Объект.РабочееМесто.АдресРазмещенияНовогоПаллетаПереупаковка;
			КонецЕсли;
		КонецЕсли;
		Объект.ПроизводственноеПомещение = Объект.РабочееМесто.ПроизводственноеПомещение;
		Объект.ЯчейкаРастарка = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, Объект.ЯчейкаПолучатель.Владелец, "ЯчейкаРастарка");
		Параметры.Свойство("ДатаУпрощенногоПроведения", Объект.ДатаУпрощенногоПроведения); 
		Параметры.Свойство("Комментарий", Объект.Комментарий);
	КонецЕсли;
	
	//РассчитатьКоличествоКоробок();
	
	ДокументПроведенПриОткрытии = Объект.Проведен;
	
	ПолныеПрава = РольДоступна("ПолныеПрава");
	Лико_ДополнительныеПраваНачальникаСГП = РольДоступна("Лико_ДополнительныеПраваНачальникаСГП");
	Элементы.СодержимоеВыбылСоСклада.Видимость = ПолныеПрава;
	Элементы.Дата.Доступность = ПолныеПрава ИЛИ Лико_ДополнительныеПраваНачальникаСГП;
	Элементы.ДатаФормирования.Доступность = ПолныеПрава;
	Элементы.Организация.Доступность = ПолныеПрава;
	Элементы.Площадка.Доступность = ПолныеПрава;
	Элементы.Подразделение.Доступность = ПолныеПрава;
	//Элементы.РаспоряжениеНаРастарку.Доступность = ПолныеПрава;
	Элементы.Паллет.Доступность = ПолныеПрава;
	Элементы.ЯчейкаПолучатель.Доступность = ПолныеПрава;
	Элементы.РабочееМесто.Доступность = ПолныеПрава;
	Элементы.ПроизводственноеПомещение.Доступность = ПолныеПрава;
	Элементы.АвторДокумента.Доступность = ПолныеПрава;
	Элементы.ЭтоПоследнийВыпускПоРастарке.Видимость = ПолныеПрава;
	Элементы.ЯчейкаРастарка.Видимость = ПолныеПрава;
	Элементы.СтраницаСодержимоеРастарки.Видимость = ПолныеПрава;
	Элементы.ДатаУпрощенногоПроведения.Доступность = ПолныеПрава;
	Элементы.СодержимоеИзменитьРаспоряжениеНаРастаркуВоВсехСтроках.Видимость = ПолныеПрава;
	Элементы.ФормаПровести.Видимость = ПолныеПрава;

	Если ПолныеПрава Тогда
		УпаковкаПроверятьКоличествоВыпуска = Ложь;
	ИначеЕсли Объект.РабочееМесто.ОбработкиДляОткрытияПриЗапуске1С.Найти(Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту("ИмяОбъекта", "Лико_РабочееМестоПеремоткаУпаковка")) <> Неопределено
		ИЛИ Объект.РабочееМесто.ТипРабочегоМеста = Перечисления.Лико_ТипыРабочегоМеста.Инфопад 
		Тогда
		// Работают через обработку "Перемотка упаковка", проверять тоже не надо
		УпаковкаПроверятьКоличествоВыпуска = Ложь;
	Иначе
		УпаковкаПроверятьКоличествоВыпуска = Истина;
	КонецЕсли;
	
	УправляющийШтрихкодПроведенияФормированияПаллета = Справочники.Лико_ПредопределенныеЗначения.УправляющийШтрихкодПроведенияФормированияПаллета.ЗначениеПараметра;
	Если НЕ ЗначениеЗаполнено(УправляющийШтрихкодПроведенияФормированияПаллета) Тогда
		Сообщить("В справочнике предопределенных значений не заполнен УправляющийШтрихкодПроведенияФормированияПаллета. Обратитесь к программистам");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТиповыеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.ТиповойДокумент) Тогда
		ПоказатьЗначение(,Элемент.ТекущиеДанные.ТиповойДокумент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ТиповыеДокументы.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);
	Элементы.ТиповыеДокументы.Обновить();
	РассчитатьКоличествоКоробок();
	
	Если УпаковкаПроверятьКоличествоВыпуска И ВТаблицеСравненияЕстьОтрицательныеЗаписи Тогда
		СформироватьИОтправитьПисьмоОПроверкеКоличестваВыпуска(Истина, ?(ПараметрыЗаписи.Свойство("ФизЛицоПодтверждения"), ПараметрыЗаписи.ФизЛицоПодтверждения, Неопределено));	
	КонецЕсли;
	// <-- Начало Лико Яцун С. В. 07.04.2025 
	Если Объект.Площадка = ПредопределенноеЗначение("Справочник.Лико_Площадки.Линкс") И УпаковкаПроверятьКоличествоВыпуска И ПроверкаВыпустилиБольшеЧемПередалиНаВК Тогда
		СформироватьИОтправитьПисьмоОПроверкеКоличестваВыпускаИКоличестваПереданногоНаВК();	
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 07.04.2025 
	
	// --> Начало Лико Ефимов ЕВВ 08.01.2020
	ДокПеремещения = Неопределено;
	Если Объект.ЯчейкаПолучатель = Объект.ЯчейкаРастарка И ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение И Объект.Проведен И НЕ ДокументПроведенПриОткрытии Тогда
		// Создадим сразу перемещение паллета на растарку и распечатаем распоряжение на растарку
		ДокПеремещения = СоздатьПеремещениеНаРастарку();
		Если ЗначениеЗаполнено(ДокПеремещения) Тогда
			Обработка = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Справочники.Лико_ПредопределенныеЗначения.ВнешняяПечатнаяФормаНакладнаяНаПередел.ЗначениеПараметра");
			Если НЕ ЗначениеЗаполнено(Обработка) Тогда
				Сообщить("В системе не зарегистрирована печатная форма ""Накладная на передел"" или она не заполнена в справочнике предопределенных значений.");
				Возврат;
			КонецЕсли;
			ИмяОбъекта = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Обработка.ИмяОбъекта", Обработка, "Обработка"); 
			МассивОбъектов = Новый Массив;
			МассивОбъектов.Добавить(ДокПеремещения);
			ПараметрыОткрытия = Новый Структура;
			ПараметрыОткрытия.Вставить("ИсточникДанных", Обработка);
			ПараметрыОткрытия.Вставить("ПараметрыИсточника", Новый Структура("ИдентификаторКоманды,ОбъектыНазначения", ИмяОбъекта, МассивОбъектов));
			ПараметрыОткрытия.Вставить("ПараметрыПечати", Неопределено);
			
			ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ЭтаФорма, Строка(Новый УникальныйИдентификатор));
		КонецЕсли		
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 08.01.2020
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение И НЕ ДокументПроведенПриОткрытии И Объект.Организация <> Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЭкоФлекс.ЗначениеПараметра") И НЕ ЗначениеЗаполнено(ДокПеремещения) Тогда
		// Нужно вывести на печать паллетный ярлык
		Обработка = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Справочники.Лико_ПредопределенныеЗначения.ВнешняяПечатнаяФормаПаллетныйЯрлык.ЗначениеПараметра");
		Если НЕ ЗначениеЗаполнено(Обработка) Тогда
			Сообщить("В системе не зарегистрирована печатная форма ""Паллетный ярлык"" или она не заполнена в справочнике предопределенных значений.");
			Возврат;
		КонецЕсли;
		ИмяОбъекта = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Обработка.ИмяОбъекта", Обработка, "Обработка"); 
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(Объект.Ссылка);
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("ИсточникДанных", Обработка);
		ПараметрыОткрытия.Вставить("ПараметрыИсточника", Новый Структура("ИдентификаторКоманды,ОбъектыНазначения", ИмяОбъекта, МассивОбъектов));
		ПараметрыОткрытия.Вставить("ПараметрыПечати", Неопределено);
		
		ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ЭтаФорма, Строка(Новый УникальныйИдентификатор));
		
	КонецЕсли;
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ДокументПроведенПриОткрытии = Истина;
	КонецЕсли; 
	
	// --> Начало Лико Ефимов ЕВВ 06.11.2025
	Если Объект.Площадка = ПредопределенноеЗначение("Справочник.Лико_Площадки.Линкс") Тогда
		Оповестить("Лико_ПроведеноФормированиеПаллета",, "Лико_ФормированиеПаллета");
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 06.11.2025
	
	Если ПараметрыЗаписи.Свойство("ЗакрытьФорму") И ПараметрыЗаписи.ЗакрытьФорму Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьИОтправитьПисьмоОПроверкеКоличестваВыпуска(ПослеЗаписи = Истина, НачальникСменыУПО = Неопределено)

	// Нужно отправить письмо старшему перемотчику
	Шобер = Объект.ПроизводственноеПомещение = Справочники.Лико_ПроизводственныеПомещения.Шобер;
	Адресат = Лико_Дополнительно.НайтиЭлектронныйАдресОтветственногоПоСкладу(Объект.ЯчейкаПолучатель.Владелец, "Лико_АдресДляОтправкиПисемОРасхожденииВыпускаИРасходаМатериала",, Ложь);
	Если ЗначениеЗаполнено(Адресат) Тогда
		Если ПослеЗаписи Тогда
			ТемаПисьма = "Расхождение при проверке количества выпуска " + Объект.Паллет;
			Если Шобер Тогда
				ТекстПисьма = "На упаковке выпустили " + Объект.Паллет + ", по которому есть расхождения с переданным на упаковку количеством (номер документа " + Объект.Номер + ")."; 
			Иначе
				ТекстПисьма = "На упаковке выпустили " + Объект.Паллет + ", по которому есть расхождения с расходом материала (номер документа " + Объект.Номер + ")."; 
			КонецЕсли;
			
			Если ЗначениеЗаполнено(НачальникСменыУПО) Тогда
				ТекстПисьма = ТекстПисьма + "<br>"  + Символы.ПС + "Подтвердил своим пропуском сотрудник " + НачальникСменыУПО + ".";
			КонецЕсли;
		Иначе
			ТемаПисьма = "Запрос пропуска для подтверждения выпуска, по которому есть расхождение при проверке количества";
			ТекстПисьма = "На упаковке " + ?(Шобер, "(шобер) ", "") + "хотят выпустить паллет, по которому есть расхождение при проверке количества. Нужно подтверждение начальника смены ОПО.";
		КонецЕсли;
		Для каждого Строка из ТаблицаПроверкиКоличестваВыпуска Цикл
			Если Строка.КоличествоРазница < 0 И НЕ Строка.НеПроверять Тогда
				Если Шобер Тогда
					ТекстПисьма = ТекстПисьма + "<br>"  + Символы.ПС + "Заказ " + Строка.Заказ.НомерБезПрефикса + ": тираж " + Строка.КоличествоЗаказано + " тыс.шт., выпущено " + Строка.КоличествоВыпущеноВсего + " тыс.шт., передано на упаковку " + Строка.КоличествоПереданоНаУпаковку + " тыс.шт., превышение " + (Строка.КоличествоРазница * -1) + " тыс.шт.";
				Иначе
					ТекстПисьма = ТекстПисьма + "<br>"  + Символы.ПС + "Заказ " + Строка.Заказ.НомерБезПрефикса + ": тираж " + Строка.КоличествоЗаказано + " тыс.шт., выпущено " + Строка.КоличествоВыпущеноВсего + " тыс.шт., расход материала " + Строка.КоличествоКвМРасходМатериала + " кв.м., выпущено " + Строка.КоличествоКвМВыпущеноВсего + " кв.м., превышение " + (Строка.КоличествоРазница * -1) + " кв.м.";
				КонецЕсли;		
			КонецЕсли;		
		КонецЦикла;
		ТекстПисьма = СтрЗаменить(ТекстПисьма, "№", "N");
		ТемаПисьма = СтрЗаменить(ТемаПисьма, "№", "N");
		Лико_Планирование.ОтправитьПисьмо(ТекстПисьма, ТемаПисьма, Адресат,,,,,, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьИОтправитьПисьмоОПроверкеКоличестваВыпускаИКоличестваПереданногоНаВК() // <-- Начало Лико Яцун С. В. 07.04.2025

	Адресаты = "TPetrova@okil-sato.ru;NShadova@okil-sato.ru;DSakhno@okil-sato.ru";
	ТемаПисьма = "Расхождение при проверке количества выпуска " + Объект.Паллет;
	ТекстПисьма = "На упаковке выпустили " + Объект.Паллет + ", по которому есть расхождения с переданным на ВК количеством (номер документа " + Объект.Номер + ")."; 
	Для каждого Строка из ТаблицаПроверкиКоличестваВыпуска Цикл
		Если Строка.КоличествоРазницаВК < 0 И НЕ Строка.НеПроверять Тогда
			ТекстПисьма = ТекстПисьма + "<br>"  + Символы.ПС + "Заказ " + Строка.Заказ.НомерБезПрефикса + ": тираж " + Строка.КоличествоЗаказано + " тыс.шт., выпущено " + Строка.КоличествоВыпущеноВсего + " тыс.шт., передано на ВК " + Строка.КоличествоПереданоНаВК + " тыс.шт., превышение " + (Строка.КоличествоРазницаВК * -1) + " тыс.шт.";
		КонецЕсли;		
	КонецЦикла;
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "№", "N");
	ТемаПисьма = СтрЗаменить(ТемаПисьма, "№", "N");
	Лико_Планирование.ОтправитьПисьмо(ТекстПисьма, ТемаПисьма, Адресаты,,,,,, Ложь);
	
КонецПроцедуры // <-- Конец Лико Яцун С. В. 07.04.2025

&НаСервере
Функция СоздатьПеремещениеНаРастарку()
	
	// Сначала попробуем найти такой документ
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_ПеремещениеПаллета.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Лико_ПеремещениеПаллета КАК Лико_ПеремещениеПаллета
		|ГДЕ
		|	Лико_ПеремещениеПаллета.Проведен
		|	И НЕ Лико_ПеремещениеПаллета.ПометкаУдаления
		|	И Лико_ПеремещениеПаллета.Дата = &Дата
		|	И Лико_ПеремещениеПаллета.ЯчейкаПолучатель = &ЯчейкаПолучатель
		|	И Лико_ПеремещениеПаллета.Паллет = &Паллет";
	
	Запрос.УстановитьПараметр("Дата", Объект.Дата + 1);
	Запрос.УстановитьПараметр("Паллет", Объект.Паллет);
	Запрос.УстановитьПараметр("ЯчейкаПолучатель", Объект.ЯчейкаПолучатель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	НовыйДок = Документы.Лико_ПеремещениеПаллета.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(НовыйДок, Объект, "АвторДокумента,Организация,Паллет,Подразделение,РабочееМесто,Площадка");
	НовыйДок.АвторДокумента = Объект.АвторДокумента;
	НовыйДок.Дата = Объект.Дата + 1;
	НовыйДок.Комментарий = "Создан на основании документа """ + Объект.Ссылка + """, т.к. в формировании ячейкой-получателем была указана ячейка-растарка";
	НовыйДок.ПричинаРастарки = Перечисления.Лико_ПричиныРастарки.КомплектацияПоЗаявкеМенеджераНаОтгрузку;
	НовыйДок.СкладОтправитель = Объект.ЯчейкаПолучатель.Владелец;
	НовыйДок.СкладПолучатель = НовыйДок.СкладОтправитель;
	НовыйДок.ЯчейкаОтправитель = Объект.ЯчейкаПолучатель;
	НовыйДок.ЯчейкаПолучатель = НовыйДок.ЯчейкаОтправитель;
	Для каждого Строка из Объект.Содержимое Цикл;
		НоваяСтрока = НовыйДок.Содержимое.Добавить();
		НоваяСтрока.Серия = Строка.Серия;
	КонецЦикла;
	Попытка
		НовыйДок.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	Исключение
		Сообщить("Не удалось создать перемещение на растарку. Описание ошибки: " + ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	Сообщить("Сформирован документ """ + НовыйДок.Ссылка + """ на растарку");
	Возврат НовыйДок.Ссылка;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МенеджерОборудованияКлиентПереопределяемый.НачатьПодключениеОборудованиеПриОткрытииФормы(ЭтаФорма, "СканерШтрихкода");
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоШтрихкодуВыполнить(Команда)
	
	ОчиститьСообщения();
	Оповещение = Новый ОписаниеОповещения("ПоискПоШтрихкодуЗавершение", ЭтотОбъект);
	ШтрихкодированиеНоменклатурыКлиент.ПоказатьВводШтрихкода(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоШтрихкодуЗавершение(ДанныеШтрихкода, ДополнительныеПараметры) Экспорт
	ОбработатьШтрихкоды(ДанныеШтрихкода);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкоды(ДанныеШтрихкода)
	Если ДанныеШтрихкода.Штрихкод = УправляющийШтрихкодПроведенияФормированияПаллета Тогда
		ПровестиИЗакрыть();
	Иначе
		ОбработатьШтрихкодыСервер(ДанныеШтрихкода);
	КонецЕсли;
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура СодержимоеПриИзменении(Элемент)
	РассчитатьКоличествоКоробок();
КонецПроцедуры

&НаСервере
Процедура РассчитатьКоличествоКоробок()
	
	КоличествоКоробок = Лико_Дополнительно.РассчитатьКоличествоКоробокВТЗ(Объект.Содержимое.Выгрузить(, "Серия"));
	КоличествоКоробокРастарки = Лико_Дополнительно.РассчитатьКоличествоКоробокВТЗ(Объект.СодержимоеРастарки.Выгрузить(, "Серия"));
	//Элементы.СтраницаТовары.Заголовок = "Товары (" + Объект.Содержимое.Количество() + ")";
	//Элементы.СтраницаСодержимоеРастарки.Заголовок = "Растариваемые коробки (" + Объект.СодержимоеРастарки.Количество() + ")";

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	РассчитатьКоличествоКоробок();
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаТоварыПоЗаказам Тогда
		ЗаполнитьТаблицуПоЗаказам();
		ЗаполнитьТаблицуПроверкиКоличестваВыпуска();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеЭлементамиФормы()
	
	Если ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата()) < Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаИспользованияНовойСхемыРастаркиВерсия3.ЗначениеПараметра Тогда 
		Элементы.ГруппаРастарка.Видимость = Объект.ТипДокумента = Перечисления.Лико_ТипыФормированияПаллет.ВыпускПродукции;
	Иначе
		Элементы.ГруппаРастарка.Видимость = Объект.ТипДокумента = Перечисления.Лико_ТипыФормированияПаллет.ВыпускПродукции И РольДоступна("ПолныеПрава");
	КонецЕсли;
	Элементы.СкладОтправитель.Видимость = Объект.ТипДокумента = Перечисления.Лико_ТипыФормированияПаллет.ПеремещениеСНеордерногоСклада;
	
	Если Элементы.ГруппаРастарка.Видимость Тогда
		ИспользуетсяНоваяСхемаРастарки = Объект.Дата >= Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаИспользованияНовойСхемыРастарки.ЗначениеПараметра; 
		Элементы.РаспоряжениеНаРастарку.Видимость = Объект.ВыпускИзРастарки И ИспользуетсяНоваяСхемаРастарки;
		Элементы.ДекорацияНадписьРаспоряжениеНаРастарку.Видимость = Объект.ВыпускИзРастарки И ИспользуетсяНоваяСхемаРастарки;
		Элементы.ЭтоПоследнийВыпускПоРастарке.Видимость = Объект.ВыпускИзРастарки;
		Элементы.ЯчейкаРастарка.Видимость = Объект.ВыпускИзРастарки И ИспользуетсяНоваяСхемаРастарки;
		Элементы.ДекорацияНадписьЯчейкаРастарка.Видимость = Объект.ВыпускИзРастарки И ИспользуетсяНоваяСхемаРастарки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыпускИзРастаркиПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПередЗаписьюВызовСервера(); 
	
	//Если НЕ ДанОтветНаВопрос И НЕ ЗначениеЗаполнено(Объект.Ссылка) И Объект.ВыпускИзРастарки И ЗначениеЗаполнено(Объект.РаспоряжениеНаРастарку) Тогда
	//	Отказ = Истина;
	//	// Нужно спросить, последний ли это выпуск
	//	ОписаниеОповещения = Новый ОписаниеОповещения("ОтветилиНаВопросОПоследнемВыпуске", ЭтотОбъект, ПараметрыЗаписи);
	//	ПоказатьВопрос(ОписаниеОповещения, "Это последний выпуск по выбранному распоряжению на растарку?", РежимДиалогаВопрос.ДаНетОтмена,, КодВозвратаДиалога.Отмена);
	//ИначеЕсли
	Если НЕ ДанОтветНаВопрос И УпаковкаПроверятьКоличествоВыпуска И (ВТаблицеСравненияЕстьОтрицательныеЗаписи ИЛИ ПроверкаВыпустилиБольшеЧемПередалиНаВК) И НЕ Объект.ВыпускИзРастарки Тогда
		Отказ = Истина;
		Если Элементы.ГруппаСтраницы.ТекущаяСтраница <> Элементы.СтраницаТоварыПоЗаказам Тогда
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаТоварыПоЗаказам;
			Сообщить("При проверке количества выпуска обнаружено превышение");
			Возврат;
		КонецЕсли; 
		// <-- Начало Лико Яцун С. В. 07.04.2025
		Если Объект.Площадка = ПредопределенноеЗначение("Справочник.Лико_Площадки.Линкс") И ПроверкаВыпустилиБольшеЧемПередалиНаВК И ВТаблицеСравненияЕстьОтрицательныеЗаписи Тогда
			ВопросРасхождения = "Есть расхождения с расходом материала и с количеством переданным на ВК! Все равно записать?";
		ИначеЕсли Объект.Площадка = ПредопределенноеЗначение("Справочник.Лико_Площадки.Линкс") И ПроверкаВыпустилиБольшеЧемПередалиНаВК Тогда
			ВопросРасхождения = "Есть расхождения с количеством переданным на ВК! Все равно записать?";
		Иначе
			ВопросРасхождения = "Есть расхождения с расходом материала! Все равно записать?";
		КонецЕсли;
		// <-- Конец Лико Яцун С. В. 07.04.2025
		// Нужно спросить про расхождение с расходом материала
		ОписаниеОповещения = Новый ОписаниеОповещения("ОтветилиНаВопросОПроверкеКоличестваВыпуска", ЭтотОбъект, ПараметрыЗаписи);
		ПоказатьВопрос(ОписаниеОповещения, ВопросРасхождения, РежимДиалогаВопрос.ДаНетОтмена,, КодВозвратаДиалога.Отмена);
	Иначе
		ДанОтветНаВопрос = Ложь;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюВызовСервера()
	
	ЗаполнитьТаблицуПроверкиКоличестваВыпуска();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПризнакВыпускаИзРастарки()
	
	Если ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата()) > Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаИспользованияНовойСхемыРастаркиВерсия3.ЗначениеПараметра И НЕ Объект.РастаркаПоСтаройСхемеВерсии2 Тогда
		
		// Заполним признак выпуска из растарки. В данном месте условно: если есть хотя бы одна коробка с распоряжением на растарку, то истина. В дальнейшем перед записью в модуле объекта будет еще один механизм заполнения
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СерииНоменклатуры.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
			|ГДЕ
			|	СерииНоменклатуры.Ссылка В(&МассивСерий)
			|	И СерииНоменклатуры.Лико_РаспоряжениеНаРастарку <> ЗНАЧЕНИЕ(Документ.Лико_ПеремещениеПаллета.ПустаяСсылка)";
		
		Запрос.УстановитьПараметр("МассивСерий", Объект.Содержимое.Выгрузить().ВыгрузитьКолонку("Серия"));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Объект.ВыпускИзРастарки = НЕ РезультатЗапроса.Пустой();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветилиНаВопросОПоследнемВыпуске(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	Иначе
		ДанОтветНаВопрос = Истина;
		Объект.ЭтоПоследнийВыпускПоРастарке = Ответ = КодВозвратаДиалога.Да;
		Записать(ДопПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветилиНаВопросОПроверкеКоличестваВыпуска(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Если Объект.Площадка = ПредопределенноеЗначение("Справочник.Лико_Площадки.Ликофлекс") Тогда
			СформироватьИОтправитьПисьмоОПроверкеКоличестваВыпуска(Ложь);
			
			ДопПараметры.Вставить("ИмяПроцедурыПриУспешномПодтверждении", "ЗаписатьДокументПослеУспешногоПодтвержденияПропуском(ДопПараметры)");
			ДопПараметры.Вставить("Должности", "ДолжностьНачальникСменыУПО");
			ОписаниеОповещенияПриЗакрытииДругойФормы = Новый ОписаниеОповещения("РезультатЧтенияПропускаОтвЛица", ЭтотОбъект, ДопПараметры);
			ТСОтладка = Ложь;
			ПараметрыОткрытияДругойФормы = Новый Структура("ТекстЗаголовка,ТСОтладка,ИмяЗначения", "Считайте пропуск начальника смены ОПО", ТСОтладка, "Сотрудник");
			ПараметрыКоманды = Лико_Дополнительно.ПолучитьПараметрыКомандыВнешнейОбработки(,, "ТСРабочийСтолЕРП");
			ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(ПараметрыКоманды.Ссылка);
			ОткрытьФорму("ВнешняяОбработка." + ИмяОбработки + ".Форма.ФормаЗапросаЧтенияШтрихкода", ПараметрыОткрытияДругойФормы, ЭтаФорма,,,,ОписаниеОповещенияПриЗакрытииДругойФормы, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Иначе
			ДанОтветНаВопрос = Истина;
			Записать(ДопПараметры);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатЧтенияПропускаОтвЛица(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Результат.Ошибка)
		ИЛИ НЕ ЗначениеЗаполнено(Результат.СчитанноеЗначение)
		ИЛИ ТипЗнч(Результат.СчитанноеЗначение) <> Тип("СправочникСсылка.ФизическиеЛица")
		Тогда
		Если ЗначениеЗаполнено(Результат.Ошибка) Тогда
			Сообщить(Результат.Ошибка);
		Иначе
			Сообщить("Пропуск не был считан");
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	НомерТелефона = "";
	ЗапрашиватьСМС = Истина;
	Должности = "";
	ДопПараметры.Свойство("Должности", Должности);
	Если ФизЛицоОбладаетПравамиНачальникаСмены(Результат.СчитанноеЗначение, НомерТелефона, ЗапрашиватьСМС, Должности) Тогда
		ЗапрашиватьСМС = Истина; // для упаковки поставим принудительно
		ДопПараметры.Вставить("ФизЛицоПодтверждения", Результат.СчитанноеЗначение);
		ДопПараметры.Вставить("СчитанПропускБригадира");
		Если ЗапрашиватьСМС Тогда
			// Потребуем подтверждение пропуска по смс
			Если НЕ ЗначениеЗаполнено(НомерТелефона) Тогда
				Сообщить("У физ лица " + Результат.СчитанноеЗначение + " не заполнен номер телефона, подтверждение невозможно");
				Возврат;
			КонецЕсли;
			
			// Сформируем код подверждения через генератор случайных чисел
			КодПотверждения = ОтправитьКодПодтвержденияПоСмс(НомерТелефона);
			
			// Запросим код подтверждения
			ДопПараметры.Вставить("КодПодтверждения", КодПотверждения);
			ОписаниеОповещенияПослеВводаВозврата = Новый ОписаниеОповещения("ВведенКодПодтвержденияДляПодтвержденияПропускаОтвЛица", ЭтотОбъект, ДопПараметры);
			//ПараметрыДляКлавиатуры = Новый Структура("НабираемыйТекст,ТекстЗаголовка", "", "Введите код из смс на номер " + НомерТелефона);
			//ОткрытьФорму("ОбщаяФорма.ТСВиртуальнаяКлавиатураЦифровая", ПараметрыДляКлавиатуры,,,,, ОписаниеОповещенияПослеВводаВозврата, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);  
			ПоказатьВводСтроки(ОписаниеОповещенияПослеВводаВозврата, "", "Введите код из смс на номер " + НомерТелефона, 4, Ложь);
		Иначе	
			// СМС не нужны, считаем проверку пройденной
			Выполнить("" + ДопПараметры.ИмяПроцедурыПриУспешномПодтверждении);
		КонецЕсли;
		
	Иначе
		Сообщить("Считан пропуск сотрудника, не обладающего требуемыми правами");
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ФизЛицоОбладаетПравамиНачальникаСмены(ФизЛицо, НомерТелефона = "", ЗапрашиватьСМС = Ложь, СтрокаДолжностей = "")
	
	ИмяФайла = ПолучитьИмяВременногоФайла();
	ВнОбработка = Лико_Дополнительно.НайтиДополнительнуюОбработкуПоИмениОбъекта("ТСРабочийСтолЕРП");
	Если НЕ ЗначениеЗаполнено(ВнОбработка) Тогда
		Сообщить("Не найдена дополнительная обработка с именем объекта ТСРабочийСтолЕРП");
		Возврат Неопределено;
	КонецЕсли;
	ДвоичныеДанные = ВнОбработка.ХранилищеОбработки.Получить();
	ДвоичныеДанные.Записать(ИмяФайла);
	ВнешняяОбработка = ВнешниеОбработки.Создать(ИмяФайла, Ложь);

	Результат = ВнешняяОбработка.ФизЛицоОбладаетПравамиНачальникаСмены(ФизЛицо, Объект.Организация, НомерТелефона, ЗапрашиватьСМС, СтрокаДолжностей);
	
	Попытка
		УдалитьФайлы(ИмяФайла);
	Исключение
	КонецПопытки;
	
	Возврат Результат;

КонецФункции

&НаСервере
Функция ОтправитьКодПодтвержденияПоСмс(НомерТелефона)
	
	ИмяФайла = ПолучитьИмяВременногоФайла();
	ВнОбработка = Лико_Дополнительно.НайтиДополнительнуюОбработкуПоИмениОбъекта("ТСРабочийСтолЕРП");
	Если НЕ ЗначениеЗаполнено(ВнОбработка) Тогда
		Сообщить("Не найдена дополнительная обработка с именем объекта ТСРабочийСтолЕРП");
		Возврат Неопределено;
	КонецЕсли;
	ДвоичныеДанные = ВнОбработка.ХранилищеОбработки.Получить();
	ДвоичныеДанные.Записать(ИмяФайла);
	ВнешняяОбработка = ВнешниеОбработки.Создать(ИмяФайла, Ложь);

	Результат =  ВнешняяОбработка.ОтправитьКодПодтвержденияПоСмс(НомерТелефона, Объект.РабочееМесто);
	
	Попытка
		УдалитьФайлы(ИмяФайла);
	Исключение
	КонецПопытки;
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Процедура ВведенКодПодтвержденияДляПодтвержденияПропускаОтвЛица(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено ИЛИ НЕ ЗначениеЗаполнено(Результат) Тогда
		Сообщить("Не введен код подтверждения из смс");
		Возврат;
	КонецЕсли;
	
	ВведенныйКод = Формат(Результат, "ЧЦ=4; ЧВН=; ЧГ=0");
	
	ТекущаяДата = ТекущаяДата();
	
	// на всякий случай будем генерить код на сегодня
	КодНаСегодня = Прав(Формат(День(ТекущаяДата) * Месяц(ТекущаяДата) * Год(ТекущаяДата) - День(ТекущаяДата) - Месяц(ТекущаяДата) - Год(ТекущаяДата), "ЧЦ=10; ЧВН=; ЧГ=0"), 4);
	
	Если ВведенныйКод <> ДопПараметры.КодПодтверждения И ВведенныйКод <> КодНаСегодня Тогда
		Сообщить("Код подтверждения не совпал: вы ввели " + ВведенныйКод + ", был отправлен " + ДопПараметры.КодПодтверждения);
		Возврат;
	КонецЕсли;
	
	// Если дошло до сюда, значит все проверки пройдены, вызовем нужную процедуру, имя которой сохранено в ДопПараметры
	Выполнить("" + ДопПараметры.ИмяПроцедурыПриУспешномПодтверждении);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокументПослеУспешногоПодтвержденияПропуском(ДопПараметры) Экспорт
	ДанОтветНаВопрос = Истина;
	Записать(ДопПараметры);
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.СтраницаТоварыПоЗаказам Тогда
		ЗаполнитьТаблицуПоЗаказам();
		ЗаполнитьТаблицуПроверкиКоличестваВыпуска();
	КонецЕсли;

КонецПроцедуры
	
&НаСервере
Процедура ЗаполнитьТаблицуПоЗаказам()
	
	ТоварыСвернуто.Очистить();
	КоличествоМестИтог = 0;
	КоличествоИтог = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(Таблица.Серия КАК Справочник.СерииНоменклатуры) КАК Серия
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&Таблица КАК Таблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Серия.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры КАК ЗаказКлиента,
		|	ВЫРАЗИТЬ(ВТ.Серия.Лико_ХарактеристикаВладелец.Владелец КАК Справочник.Номенклатура) КАК Номенклатура,
		|	ВТ.Серия.Лико_Город КАК Город,
		|	СУММА(ВТ.Серия.Лико_КоличествоКоробок) КАК КоличествоМест,
		|	СУММА(ВТ.Серия.Лико_КоличествоВУпаковке) КАК Количество,
		|	ВТ.Серия.Лико_НаправлениеНамотки КАК Намотка,
		|	ВТ.Серия.Лико_КодЭтикеткиЗаказчика КАК КодЭтикеткиЗаказчика
		|ИЗ
		|	ВТ КАК ВТ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.Серия.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры,
		|	ВЫРАЗИТЬ(ВТ.Серия.Лико_ХарактеристикаВладелец.Владелец КАК Справочник.Номенклатура),
		|	ВТ.Серия.Лико_Город,
		|	ВТ.Серия.Лико_НаправлениеНамотки,
		|	ВТ.Серия.Лико_КодЭтикеткиЗаказчика
		|УПОРЯДОЧИТЬ ПО
		|	ВТ.Серия.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры.Партнер.Наименование,
		|	ВТ.Серия.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры.НомерБезПрефикса";
	
	Запрос.УстановитьПараметр("Таблица", Объект.Содержимое.Выгрузить());
	ТоварыСвернуто.Загрузить(Запрос.Выполнить().Выгрузить());
	ТекНомерСтроки = 0;
	Для каждого Строка из ТоварыСвернуто Цикл
		ТекНомерСтроки = ТекНомерСтроки + 1;
		Строка.НомерСтроки = ТекНомерСтроки;
	КонецЦикла;
	
	КоличествоМестИтог = ТоварыСвернуто.Итог("КоличествоМест");
	КоличествоИтог = ТоварыСвернуто.Итог("Количество");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуПроверкиКоличестваВыпуска()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Объект.ПроизводственноеПомещение = Справочники.Лико_ПроизводственныеПомещения.Шобер
		Тогда
		Шобер = Истина;
		Элементы.ТаблицаПроверкиКоличестваВыпускаКоличествоПереданоНаУпаковку.Видимость = Истина;
		Элементы.ТаблицаПроверкиКоличестваВыпускаКоличествоКвМРасходМатериала.Видимость = Ложь;
		Элементы.ТаблицаПроверкиКоличестваВыпускаКоличествоКвМВыпущеноВсего.Видимость = Ложь;
		Элементы.ТаблицаПроверкиКоличестваВыпускаКоличествоКвМРазница.Заголовок = "Разница (тыс.шт.)";
	Иначе
		Шобер = Ложь;
		Элементы.ТаблицаПроверкиКоличестваВыпускаКоличествоПереданоНаУпаковку.Видимость = Ложь;
		Элементы.ТаблицаПроверкиКоличестваВыпускаКоличествоКвМРасходМатериала.Видимость = Истина;
		Элементы.ТаблицаПроверкиКоличестваВыпускаКоличествоКвМВыпущеноВсего.Видимость = Истина;
		Элементы.ТаблицаПроверкиКоличестваВыпускаКоличествоКвМРазница.Заголовок = "Разница (м2)";
	КонецЕсли;
	// <-- Начало Лико Яцун С. В. 07.04.2025
	Если НЕ Объект.Площадка = Справочники.Лико_Площадки.Линкс Тогда
		Элементы.ТаблицаПроверкиКоличестваВыпускаКоличествоПереданоНаВК.Видимость = Ложь;
		Элементы.ТаблицаПроверкиКоличестваВыпускаКоличествоРазницаВК.Видимость = Ложь;
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 07.04.2025
	
	ЗаполнитьПризнакВыпускаИзРастарки();
	
	ТаблицаПроверкиКоличестваВыпуска.Очистить();
	ВТаблицеСравненияЕстьОтрицательныеЗаписи = Ложь;
	ПроверкаВыпустилиБольшеЧемПередалиНаВК = Ложь;
	Если Объект.ТипДокумента <> Перечисления.Лико_ТипыФормированияПаллет.ВыпускПродукции ИЛИ Объект.ВыпускИзРастарки Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(Таблица.Серия КАК Справочник.СерииНоменклатуры) КАК Серия
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&Таблица КАК Таблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Серия.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры КАК Заказ,
		|	СУММА(ВТ.Серия.Лико_КоличествоВУпаковке) КАК КоличествоВДокументе
		|ПОМЕСТИТЬ ВТ_ЗаказыДокумента
		|ИЗ
		|	ВТ КАК ВТ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.Серия.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Лико_ПеремещениеПаллетаСодержимое.Серия КАК Серия
		|ПОМЕСТИТЬ ВТ_КоробкиВРастаркеКУдалению
		|ИЗ
		|	Документ.Лико_ПеремещениеПаллета КАК Лико_ПеремещениеПаллета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лико_ПеремещениеПаллета.Содержимое КАК Лико_ПеремещениеПаллетаСодержимое
		|		ПО Лико_ПеремещениеПаллета.Ссылка = Лико_ПеремещениеПаллетаСодержимое.Ссылка
		|ГДЕ
		|	Лико_ПеремещениеПаллета.Проведен
		|	И НЕ Лико_ПеремещениеПаллета.ПометкаУдаления
		|	И Лико_ПеремещениеПаллета.ЯчейкаПолучатель = &ЯчейкаРастарка
		|	И Лико_ПеремещениеПаллета.ПричинаРастарки = ЗНАЧЕНИЕ(Перечисление.Лико_ПричиныРастарки.ПереупаковкаОшибкаМаркировки)
		|
		|СГРУППИРОВАТЬ ПО
		|	Лико_ПеремещениеПаллетаСодержимое.Серия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Лико_ФормированиеПаллетаСодержимое.Серия.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры КАК Заказ,
		|	СУММА(Лико_ФормированиеПаллетаСодержимое.Серия.Лико_КоличествоВУпаковке) КАК КоличествоВыпущеноБезТекущегоДокумента,
		|	0 КАК КоличествоВДокументе
		|ПОМЕСТИТЬ ВТ_ЗаказыСВыпусками
		|ИЗ
		|	Документ.Лико_ФормированиеПаллета КАК Лико_ФормированиеПаллета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лико_ФормированиеПаллета.Содержимое КАК Лико_ФормированиеПаллетаСодержимое
		|		ПО Лико_ФормированиеПаллета.Ссылка = Лико_ФормированиеПаллетаСодержимое.Ссылка
		|			И Лико_ФормированиеПаллета.Ссылка = Лико_ФормированиеПаллетаСодержимое.Ссылка
		|			И (Лико_ФормированиеПаллетаСодержимое.Серия.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры В
		|				(ВЫБРАТЬ
		|					ВТ_ЗаказыДокумента.Заказ
		|				ИЗ
		|					ВТ_ЗаказыДокумента))
		|			И (НЕ Лико_ФормированиеПаллетаСодержимое.Серия В
		|					(ВЫБРАТЬ
		|						Т.Серия
		|					ИЗ
		|						ВТ_КоробкиВРастаркеКУдалению КАК Т))
		|ГДЕ
		|	Лико_ФормированиеПаллета.Проведен
		|	И НЕ Лико_ФормированиеПаллета.ПометкаУдаления
		|	И Лико_ФормированиеПаллета.ТипДокумента = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыФормированияПаллет.ВыпускПродукции)
		|	И НЕ Лико_ФормированиеПаллета.ВыпускИзРастарки
		|	И Лико_ФормированиеПаллета.Ссылка <> &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	Лико_ФормированиеПаллетаСодержимое.Серия.Лико_ХарактеристикаВладелец.Лико_ЗаказНоменклатуры
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ЗаказыДокумента.Заказ,
		|	0,
		|	ВТ_ЗаказыДокумента.КоличествоВДокументе
		|ИЗ
		|	ВТ_ЗаказыДокумента КАК ВТ_ЗаказыДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЗаказыСВыпусками.Заказ КАК Заказ,
		|	ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ОсновнойМатериал) КАК СтатьяЗатрат,
		|	ВТ_ЗаказыСВыпусками.Заказ.МетражКВМ / ВЫБОР
		|		КОГДА ВТ_ЗаказыСВыпусками.Заказ.Тираж = 0
		|			ТОГДА 1
		|		ИНАЧЕ ВТ_ЗаказыСВыпусками.Заказ.Тираж
		|	КОНЕЦ КАК КвМетровВТысШт,
		|	СУММА(ВТ_ЗаказыСВыпусками.КоличествоВыпущеноБезТекущегоДокумента) КАК КоличествоВыпущеноБезТекущегоДокумента,
		|	СУММА(ВТ_ЗаказыСВыпусками.КоличествоВДокументе) КАК КоличествоВДокументе
		|ПОМЕСТИТЬ ВТ_ЗаказыСВыпускамиСгруппировано
		|ИЗ
		|	ВТ_ЗаказыСВыпусками КАК ВТ_ЗаказыСВыпусками
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ЗаказыСВыпусками.Заказ,
		|	ВТ_ЗаказыСВыпусками.Заказ.МетражКВМ / ВЫБОР
		|		КОГДА ВТ_ЗаказыСВыпусками.Заказ.Тираж = 0
		|			ТОГДА 1
		|		ИНАЧЕ ВТ_ЗаказыСВыпусками.Заказ.Тираж
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЗаказыСВыпускамиСгруппировано.Заказ КАК Заказ,
		|	ВТ_ЗаказыСВыпускамиСгруппировано.КоличествоВыпущеноБезТекущегоДокумента КАК КоличествоВыпущеноБезТекущегоДокумента,
		|	ВТ_ЗаказыСВыпускамиСгруппировано.КоличествоВДокументе КАК КоличествоВыпущеноТекущимДокументом,
		|	ВТ_ЗаказыСВыпускамиСгруппировано.КоличествоВыпущеноБезТекущегоДокумента * ВТ_ЗаказыСВыпускамиСгруппировано.КвМетровВТысШт КАК КоличествоКвМВыпущеноБезТекущегоДокумента,
		|	ВТ_ЗаказыСВыпускамиСгруппировано.КоличествоВДокументе * ВТ_ЗаказыСВыпускамиСгруппировано.КвМетровВТысШт КАК КоличествоКвМВыпущеноТекущимДокументом,
		|	СУММА(ЕСТЬNULL(Лико_ЗатратыПоЗаказуОбороты.КоличествоОборот, 0)) КАК КоличествоКвМРасходМатериала
		|ПОМЕСТИТЬ ВТ_Итог
		|ИЗ
		|	ВТ_ЗаказыСВыпускамиСгруппировано КАК ВТ_ЗаказыСВыпускамиСгруппировано
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Лико_ЗатратыПоЗаказу.Обороты(
		|				,
		|				,
		|				,
		|				(ЗаказКлиента, СтатьяЗатрат) В
		|					(ВЫБРАТЬ
		|						Т.Заказ,
		|						Т.СтатьяЗатрат
		|					ИЗ
		|						ВТ_ЗаказыСВыпускамиСгруппировано КАК Т)) КАК Лико_ЗатратыПоЗаказуОбороты
		|		ПО ВТ_ЗаказыСВыпускамиСгруппировано.Заказ = Лико_ЗатратыПоЗаказуОбороты.ЗаказКлиента
		|			И ВТ_ЗаказыСВыпускамиСгруппировано.СтатьяЗатрат = Лико_ЗатратыПоЗаказуОбороты.СтатьяЗатрат
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ЗаказыСВыпускамиСгруппировано.Заказ,
		|	ВТ_ЗаказыСВыпускамиСгруппировано.КоличествоВыпущеноБезТекущегоДокумента,
		|	ВТ_ЗаказыСВыпускамиСгруппировано.КоличествоВДокументе,
		|	ВТ_ЗаказыСВыпускамиСгруппировано.КоличествоВыпущеноБезТекущегоДокумента * ВТ_ЗаказыСВыпускамиСгруппировано.КвМетровВТысШт,
		|	ВТ_ЗаказыСВыпускамиСгруппировано.КоличествоВДокументе * ВТ_ЗаказыСВыпускамиСгруппировано.КвМетровВТысШт
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Итог.Заказ КАК Заказ,
		|	СУММА(Лико_ДвиженияЗаказаПоЭтапамВыходнойКонтроль.Количество) КАК КоличествоПереданоНаУпаковку
		|ПОМЕСТИТЬ ВТ_ПереданоНаУпаковку
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лико_ДвиженияЗаказаПоЭтапам КАК Лико_ДвиженияЗаказаПоЭтапам
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лико_ДвиженияЗаказаПоЭтапам.ВыходнойКонтроль КАК Лико_ДвиженияЗаказаПоЭтапамВыходнойКонтроль
		|			ПО Лико_ДвиженияЗаказаПоЭтапам.Ссылка = Лико_ДвиженияЗаказаПоЭтапамВыходнойКонтроль.Ссылка
		|				И (Лико_ДвиженияЗаказаПоЭтапамВыходнойКонтроль.ВидРабочегоМеста = ""Шобер"")
		|		ПО ВТ_Итог.Заказ = Лико_ДвиженияЗаказаПоЭтапам.ЗаказКлиента
		|			И (Лико_ДвиженияЗаказаПоЭтапам.Проведен)
		|ГДЕ
		|	&Шобер
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Итог.Заказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Итог.Заказ КАК Заказ,
		|	СУММА(Лико_УчетГотовыхЭтикетокОбороты.КоличествоПриход) КАК КоличествоПриход
		|ПОМЕСТИТЬ ВТЛинксПереданоНаВК
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Лико_УчетГотовыхЭтикеток.Обороты(, , , Место = ЗНАЧЕНИЕ(Перечисление.Лико_МестаУчетаГотовыхЭтикеток.Перемотка)) КАК Лико_УчетГотовыхЭтикетокОбороты
		|		ПО ВТ_Итог.Заказ = Лико_УчетГотовыхЭтикетокОбороты.ЗаказКлиента
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Итог.Заказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Итог.Заказ КАК Заказ,
		|	ВТ_Итог.Заказ.Тираж КАК КоличествоЗаказано,
		|	ВТ_Итог.КоличествоКвМВыпущеноБезТекущегоДокумента КАК КоличествоКвМВыпущеноБезТекущегоДокумента,
		|	ВТ_Итог.КоличествоКвМВыпущеноТекущимДокументом КАК КоличествоКвМВыпущеноТекущимДокументом,
		|	ВТ_Итог.КоличествоКвМРасходМатериала КАК КоличествоКвМРасходМатериала,
		|	ВТ_Итог.КоличествоКвМВыпущеноБезТекущегоДокумента + ВТ_Итог.КоличествоКвМВыпущеноТекущимДокументом КАК КоличествоКвМВыпущеноВсего,
		|	ВТ_Итог.КоличествоВыпущеноБезТекущегоДокумента + ВТ_Итог.КоличествоВыпущеноТекущимДокументом КАК КоличествоВыпущеноВсего,
		|	ВЫБОР
		|		КОГДА &Шобер
		|			ТОГДА ЕСТЬNULL(ВТ_ПереданоНаУпаковку.КоличествоПереданоНаУпаковку, 0) - ВТ_Итог.КоличествоВыпущеноБезТекущегоДокумента - ВТ_Итог.КоличествоВыпущеноТекущимДокументом
		|		ИНАЧЕ ВТ_Итог.КоличествоКвМРасходМатериала - ВТ_Итог.КоличествоКвМВыпущеноБезТекущегоДокумента - ВТ_Итог.КоличествоКвМВыпущеноТекущимДокументом
		|	КОНЕЦ КАК КоличествоРазница,
		|	ВЫБОР
		|		КОГДА ВТ_Итог.Заказ.ВидЗаказа = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыЗаказов.ПеределЗаказаПереборкаПереупаковка)
		|				ИЛИ ВТ_Итог.Заказ.Комбинированный
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК НеПроверять,
		|	ЕСТЬNULL(ВТ_ПереданоНаУпаковку.КоличествоПереданоНаУпаковку, 0) КАК КоличествоПереданоНаУпаковку,
		|	ЕСТЬNULL(ВТЛинксПереданоНаВК.КоличествоПриход, 0) КАК КоличествоПереданоНаВК,
		|	ЕСТЬNULL(ВТЛинксПереданоНаВК.КоличествоПриход, 0) - ВТ_Итог.КоличествоВыпущеноБезТекущегоДокумента - ВТ_Итог.КоличествоВыпущеноТекущимДокументом КАК КоличествоРазницаВК
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПереданоНаУпаковку КАК ВТ_ПереданоНаУпаковку
		|		ПО ВТ_Итог.Заказ = ВТ_ПереданоНаУпаковку.Заказ
		|			И (&Шобер)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛинксПереданоНаВК КАК ВТЛинксПереданоНаВК
		|		ПО ВТ_Итог.Заказ = ВТЛинксПереданоНаВК.Заказ";
	
	Запрос.УстановитьПараметр("Таблица", Объект.Содержимое.Выгрузить());
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("ЯчейкаРастарка", Объект.ЯчейкаРастарка);
	Запрос.УстановитьПараметр("Шобер", Шобер);
	
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	ТаблицаПроверкиКоличестваВыпуска.Загрузить(ТаблицаРезультат);
	
	// --> Начало Лико Ефимов ЕВВ 03.06.2024
	// Потом убрать
	ВключенаПроверкаУпаковкиНаШобере = Справочники.Лико_ПредопределенныеЗначения.ВключенаПроверкаУпаковкиНаШобере.ЗначениеПараметра;
	Если НЕ ЗначениеЗаполнено(ВключенаПроверкаУпаковкиНаШобере) Тогда
		ВключенаПроверкаУпаковкиНаШобере = Ложь;
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 03.06.2024
	
	Для каждого Строка из ТаблицаРезультат Цикл
		// <-- Начало Лико Яцун С. В. 07.04.2025 
		Если Объект.Площадка = Справочники.Лико_Площадки.Линкс И Строка.КоличествоРазницаВК < 0 И НЕ Строка.НеПроверять Тогда
			ПроверкаВыпустилиБольшеЧемПередалиНаВК = Истина;	
		КонецЕсли;
		// <-- Конец Лико Яцун С. В. 07.04.2025
		Если Строка.КоличествоРазница < 0 И НЕ Строка.НеПроверять Тогда
			// --> Начало Лико Ефимов ЕВВ 03.06.2024
			// Потом убрать
			Если Шобер И НЕ ВключенаПроверкаУпаковкиНаШобере Тогда
				Продолжить;
			КонецЕсли; 
			// <-- Конец Лико Ефимов ЕВВ 03.06.2024
			
			ВТаблицеСравненияЕстьОтрицательныеЗаписи = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	//ТекНомерСтроки = 0;
	//Для каждого Строка из ТоварыСвернуто Цикл
	//	ТекНомерСтроки = ТекНомерСтроки + 1;
	//	Строка.НомерСтроки = ТекНомерСтроки;
	//КонецЦикла;
	
	//КоличествоМестИтог = ТоварыСвернуто.Итог("КоличествоМест");
	//КоличествоИтог = ТоварыСвернуто.Итог("Количество");
	
КонецПроцедуры

&НаКлиенте
Процедура ТипДокументаПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере
Процедура ЯчейкаПолучательПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.ЯчейкаПолучатель) Тогда
		Объект.ЯчейкаРастарка = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, Объект.ЯчейкаПолучатель.Владелец, "ЯчейкаРастарка");
	Иначе
		Объект.ЯчейкаРастарка = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЯчейкаПолучательПриИзменении(Элемент)
	ЯчейкаПолучательПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда = Неопределено)
	
	Если Объект.Содержимое.Количество() = 0 Тогда
		Сообщить("Сначала считайте штрихкоды коробок");
		Возврат;
	КонецЕсли;    
	
	Записать(Новый Структура("РежимЗаписи,ЗакрытьФорму", РежимЗаписиДокумента.Проведение, Истина));
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьРаспоряжениеНаРастаркуВоВсехСтроках(Команда)
	
	ПоказатьВводЗначения(Новый ОписаниеОповещения("ВыбраноПеремещениеНаРастарку", ЭтотОбъект), ПредопределенноеЗначение("Документ.Лико_ПеремещениеПаллета.ПустаяСсылка"), "Выберите распоряжение");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбраноПеремещениеНаРастарку(ВыбранноеЗначение, ДопПараметры) Экспорт
	
	//Если ВыбранноеЗначение = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;

	ДопПараметры = Новый Структура("Лико_РаспоряжениеНаРастарку", ВыбранноеЗначение);
	ПоказатьВводЧисла(Новый ОписаниеОповещения("ВыбранНомерЦепочкиВРаспоряженииНаРастарку", ЭтотОбъект, ДопПараметры), 0, "Введите номер цепочки", 3, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбранНомерЦепочкиВРаспоряженииНаРастарку(ВыбранноеЗначение, ДопПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ДопПараметры.Вставить("Лико_НомерЦепочкиВРаспоряженииНаРастарку", ВыбранноеЗначение);
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ВыбраныДополнительныеНомераЦепочек", ЭтотОбъект, ДопПараметры), "", "Введите дополнительные номера цепочек через запятую", 50, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбраныДополнительныеНомераЦепочек(ВыбранноеЗначение, ДопПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ДопПараметры.Вставить("Лико_ДополнительныеНомераЦепочек", ВыбранноеЗначение);
	
	ИзменитьРаспоряжениеНаРастаркуВоВсехСтрокахНаСервере(ДопПараметры);
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьРаспоряжениеНаРастаркуВоВсехСтрокахНаСервере(ДопПараметры)
	
	Если Объект.Содержимое.Количество() > 0 И РольДоступна("ПолныеПрава") Тогда
		НачатьТранзакцию();
		Для каждого Строка из Объект.Содержимое Цикл
			СерияОбъект = Строка.Серия.ПолучитьОбъект();
			ЗаполнитьЗначенияСвойств(СерияОбъект, ДопПараметры);
			Попытка
				СерияОбъект.Записать();
				Сообщить("Записана серия """ + Строка.Серия + """");
			Исключение
				Сообщить("Не удалось записать серию """ + Строка.Серия + """");
				ОтменитьТранзакцию();
				ВызватьИсключение;
			КонецПопытки;
		КонецЦикла;
		Сообщить("Обработка завершена");
		ЗафиксироватьТранзакцию();	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	//Если ЗначениеЗаполнено(Объект.ДатаУпрощенногоПроведения) И ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
	//	ДопровестиФормированиеПаллетаВФоне(Объект.Ссылка);
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СодержимоеСерияПриИзменении(Элемент)
		ПроверитьИзменитьОрганизациюДокумента();
КонецПроцедуры

//&НаСервереБезКонтекста
//Процедура ДопровестиФормированиеПаллетаВФоне(ФормированиеПаллетаСсылка)
//	
//	ОтменитьАктивныеФоновыеЗаданияПоПроведениюФормированияПаллета(ФормированиеПаллетаСсылка);
//	
//	ИмяМетода = "Лико_Дополнительно.ДопровестиФормированиеПаллетаВФоне";
//	
//	ПараметрыПроцедуры = Новый Массив();
//	ПараметрыПроцедуры.Добавить(ФормированиеПаллетаСсылка);
//	
//	ПараметрыЗадания = Новый Массив();
//	ПараметрыЗадания.Добавить(ИмяМетода);
//	ПараметрыЗадания.Добавить(ПараметрыПроцедуры);
//	
//	КлючЗадания = "Лико_ПроведениеФормированияПаллетаВФоне" + Строка(ФормированиеПаллетаСсылка.УникальныйИдентификатор());
//	
//	НаименованиеЗадания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
//	НСтр("ru = 'Проведение формирования паллета в фоне'"),
//	ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ФормированиеПаллетаСсылка, "Представление"));
//	
//	Попытка
//		ФоновыеЗадания.Выполнить(
//		"ОбщегоНазначения.ВыполнитьМетодКонфигурации",
//		ПараметрыЗадания,
//		КлючЗадания,
//		НаименованиеЗадания);
//	Исключение
//	КонецПопытки;
//	
//КонецПроцедуры

//&НаСервереБезКонтекста
//Процедура ОтменитьАктивныеФоновыеЗаданияПоПроведениюФормированияПаллета(ФормированиеПаллетаСсылка) 

//	Если НЕ ЗначениеЗаполнено(ФормированиеПаллетаСсылка) Тогда
//		Возврат;
//	КонецЕсли;

//	Если ТипЗнч(ФормированиеПаллетаСсылка) <> Тип("ДокументСсылка.Лико_ФормированиеПаллета") Тогда
//		Возврат;
//	КонецЕсли;
//	
//	ОтборЗаданий = Новый Структура;
//	ОтборЗаданий.Вставить("Ключ", "Лико_ПроведениеФормированияПаллетаВФоне" + Строка(ФормированиеПаллетаСсылка.УникальныйИдентификатор()));
//	ОтборЗаданий.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
//	Задания = ФоновыеЗадания.ПолучитьФоновыеЗадания(ОтборЗаданий);
//	
//	Для каждого Задание Из Задания Цикл
//		Попытка
//			Задание.Отменить();
//		Исключение
//			// Возможно задание как раз в этот момент закончилось и ошибки нет.
//			СобытиеЖурналаРегистрации = НСтр(
//			"ru = 'Проведение формирования паллета в фоне. Отмена фонового задания'",
//			ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
//			ЗаписьЖурналаРегистрации(
//			СобытиеЖурналаРегистрации,
//			УровеньЖурналаРегистрации.Ошибка,
//			ФормированиеПаллетаСсылка.Метаданные(),
//			ФормированиеПаллетаСсылка,
//			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
//		КонецПопытки;
//	КонецЦикла;
//	
//КонецПроцедуры
